Repository: wolfsoft/libdcl
Catalog: po/*.po
Languages: ru_ru

source: Fatal error: {0}
ru_ru: Неустранимая ошибка: {0}

source: Can't initialize the GtkMessageDialog
ru_ru: Невозможно инициализировать GtkMessageDialog

source: configuration file not found; default values will be used
ru_ru: файл конфигурации не был найден; будут использованы значения по умолчанию

source: show this help page
ru_ru: показать эту страницу помощи

source: syntax error
ru_ru: синтаксическая ошибка

source: Usage:
ru_ru: Использование:

source: [options...]
ru_ru: [опции...]

source: file(s)...
ru_ru: файл(ы)...

source: Where available options are:
ru_ru: Где доступными опциями являются:

source: invalid option '{0}'
ru_ru: неверная опция '{0}'

source: option unrecognized
ru_ru: опция нераспознана

source: option '{0}' requires an argument
ru_ru: опция '{0}' требует аргумент

source: Can't initialize ODBC environment
ru_ru: Невозможно осуществить инициализацию окружения ODBC

source: Can't allocate ODBC environment handle
ru_ru: Невозможно осуществить инициализацию окружения ODBC

source: Can't setup ODBC environment version
ru_ru: Невозможно установить версию окружения ODBC

source: Can't allocate ODBC connection handle
ru_ru: Невозможно осуществить подключение через ODBC

source: Can't open the database {0}: {1}
ru_ru: Невозможно открыть базу данных {0}: {1}

source: Can't open the database: {0}
ru_ru: Невозможно открыть базу данных: {0}

source: Invalid transaction isolation level
ru_ru: Неверный уровень изоляции транзакции

source: Can't setup the transaction isolation level: {0}
ru_ru: Невозможно установить уровень изоляции транзакции: {0}

source: Can't turn off autocommit mode: {0}
ru_ru: Невозможно отключить режим автоматического подтверждения: {0}

source: Transaction commit failed: {0}
ru_ru: Не удалось подтвердить транзакцию: {0}

source: Can't turn on autocommit mode: {0}
ru_ru: Невозможно включить режим автоматического подтверждения: {0}

source: Transaction rollback failed: {0}
ru_ru: Не удалось отменить транзакцию: {0}

source: Can't create class {0}: the class with this name is not registered
ru_ru: Невозможно создать класс {0}: класс с таким именем не зарегистрирован

source: Can't register class {0}: the class with this name is already registered
ru_ru: Невозможно зарегистрировать класс {0}: класс с таким именем уже зарегистрирован

source: Can't unregister class {0}: the class is not registered
ru_ru: Невозможно отменить регистрацию класса {0}: класс не зарегистрирован

source: Invalid GUI frontend library
ru_ru: Неверная библиотека обслуживания GUI

source: The specified variable doesn't exist
ru_ru: Заданная переменная не существует

source: Can't obtain data from the web server
ru_ru: Невозможно получить данные от web сервера

source: Can't send data to the web server
ru_ru: Невозможно отправить данные на web сервер

source: can't initialize SSL context
ru_ru: невозможно инициализировать SSL контекст

source: invalid CA certificate
ru_ru: неправильный сертификат CA

source: can't load certificate file
ru_ru: не удалось загрузить файл сертификата

source: can't load private key file
ru_ru: не удалось загрузить файл закрытого ключа

source: private key is invalid
ru_ru: неправильный закрытый ключ

source: configuration file reloaded
ru_ru: файл конфигурации перезагружен

source: successfully started
ru_ru: успешно запущено

source: successfully terminated
ru_ru: успешно остановлено

source: the mutex is already locked by the calling thread
ru_ru: мьютекс уже заблокирован вызывающим потоком

source: the mutex has not been properly initialized
ru_ru: мьютекс не был правильно инициализирован

source: the calling thread does not own the mutex
ru_ru: вызывающий поток не владеет мьютексом

source: Plugin '{0}' can't create object '{1}'
ru_ru: Библиотека расширения '{0}' не может создать объект '{1}'

source: pipe failed
ru_ru: невозможно создать канал

source: execv failed
ru_ru: функция execv выполнена с ошибкой

source: vfork failed
ru_ru: функция vfork выполнена с ошибкой

source: the rwlock is already locked by the calling thread
ru_ru: объект блокировки rwlock уже заблокирован вызывающим потоком

source: the rwlock has not been properly initialized
ru_ru: объект блокировки rwlock не был правильно инициализирован

source: the calling thread does not own the rwlock
ru_ru: вызывающий поток не владеет объектом блокировки rwlock

source: The system lacked the necessary resources to create another thread, or the system-imposed limit on the total number of threads in a process would be exceeded
ru_ru: В системе отсутствуют необходимые ресурсы для создания еще одного потока или был превышен системный лимит максимального числа потоков на процесс

source: Can't create detached thread
ru_ru: Невозможно создать отсоединенный поток

source: The caller does not have appropriate permission to set the required scheduling parameters or scheduling policy
ru_ru: Вызывающий не имеет соответствующих прав на установку требуемых параметров планировщика или политики планирования

source: pthread_create() fails by unknown error
ru_ru: вызов pthread_create() не удался из-за неизвестной ошибки

source: Can't allocate ODBC statement handle
ru_ru: Невозможно осуществить инициализацию оператора ODBC

source: Can't prepare SQL statement: {0}
ru_ru: Невозможно подготовить SQL запрос: {0}

source: Can't obtain a columns count: {0}
ru_ru: Невозможно определить количество столбцов: {0}

source: Can't obtain column metadata: {0}
ru_ru: Невозможно получить метаданные для столбца: {0}

source: Can't assign SQL parameter: {0}
ru_ru: Невозможно назначить SQL параметр: {0}

source: Can't execute SQL statement: {0}
ru_ru: Невозможно выполнить SQL запрос: {0}

source: Can't fetch the data row: {0}
ru_ru: Невозможно получить строку данных: {0}

source: Can't retrieve data for column: {0}
ru_ru: Невозможно получить данные для столбца: {0}

source: host '{0}' is not found
ru_ru: узел '{0}' не найден

source: can't access host '{0}'
ru_ru: невозможно обратиться к узлу '{0}'

source: can't resolve host '{0}'
ru_ru: невозможно получить адрес узла '{0}'

source: can't assign an address to a socket
ru_ru: Невозможно назначить адрес сокету

source: can't setup socket options
ru_ru: Невозможно установить опции сокета

source: can't bind to the address or port
ru_ru: Невозможно привязаться к адресу или порту

source: can't listen socket
ru_ru: Невозможно перевести сокет в режим прослушивания

source: can't accept incoming connection
ru_ru: Невозможно принять входящее соединение

source: can't change socket blocking state
ru_ru: Невозможно изменить состояние блокирования сокета

source: can't get socket blocking state
ru_ru: Невозможно определить состояние блокирования сокета

source: can't create socket
ru_ru: Невозможно создать сокет

source: can't initialize input/output thread
ru_ru: Невозможно инициализировать поток ввода/вывода

source: install Windows service
ru_ru: установить службу Windows

source: uninstall Windows service
ru_ru: удалить службу Windows

source: can't create a Windows registry key
ru_ru: невозможно создать ключ реестра Windows

source: can't write a value into the Windows registry key
ru_ru: невозможно записать значение в ключ реестра Windows

source: Windows service installed successfully.
ru_ru: Служба Windows успешно установлена.

source: can't create Windows service
ru_ru: невозможно создать службу Windows

source: can't open Windows service
ru_ru: невозможно открыть службу Windows

source: Windows service uninstalled successfully.
ru_ru: Служба Windows была успешно удалена.

source: can't delete Windows service
ru_ru: невозможно удалить службу Windows

source: can't start Windows service
ru_ru: невозможно запустить службу Windows

source: can't register Windows service control handler
ru_ru: невозможно зарегистрировать обработчик управления службой Windows

source: Can't load dynamic library '{0}'
ru_ru: Невозможно загрузить динамическую библиотеку '{0}'

source: void init(void*) function is not found in the library '{0}'
ru_ru: не найдена функция void init(void*) в библиотеке '{0}'

source: disposable* create_object(const char*) function is not found in the library '{0}'
ru_ru: не найдена функция disposable* create_object(const char*) в библиотеке '{0}'

source: void destroy_object(disposable*) function is not found in the library '{0}'
ru_ru: не найдена функция void destroy_object(disposable*) в библиотеке '{0}'

source: void finalize() function is not found in the library '{0}'
ru_ru: не найдена функция void finalize() в библиотеке '{0}'

source: CreatePipe failed
ru_ru: функция CreatePipe выполнена с ошибкой

source: SetHandleInformation failed
ru_ru: функция SetHandleInformation выполнена с ошибкой

source: CreateProcess failed
ru_ru: функция CreateProcess выполнена с ошибкой

source: WriteFile failed
ru_ru: функция WriteFile выполнена с ошибкой
